{"id":2697,"date":"2023-06-27T13:07:10","date_gmt":"2023-06-27T11:07:10","guid":{"rendered":"https:\/\/info.dextools.io\/?p=2697"},"modified":"2023-06-27T15:55:04","modified_gmt":"2023-06-27T13:55:04","slug":"bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2","status":"publish","type":"post","link":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/","title":{"rendered":"BNB launches opBNB! Learn more about scalability and testnets."},"content":{"rendered":"<p>&nbsp;<\/p>\n<p>BNB launches opBNB Testnet. The BNB Chain team has announced the launch of opBNB, a Layer 2 network based on Optimism OP Stack and compatible with the Ethereum Virtual Machine <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/ethereum-virtual-machine\/\">(EVM)<\/a>. The new solution was released on June 19 as a test mode on the <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/bnb-chain\/\">BNB Smart Chain<\/a> (BSC) network.<\/p>\n<p>&nbsp;<\/p>\n<div class=\"embed-container\">\n<blockquote class=\"twitter-tweet\" data-width=\"500\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Start building using the opBNB testnet today! 🏆 <a href=\"https:\/\/t.co\/5R0Wc2L4R2\">https:\/\/t.co\/5R0Wc2L4R2<\/a><\/p>\n<p>&mdash; BNB Chain (@BNBCHAIN) <a href=\"https:\/\/twitter.com\/BNBCHAIN\/status\/1672786689025007617?ref_src=twsrc%5Etfw\">June 25, 2023<\/a><\/p><\/blockquote>\n<p><script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/div>\n<h1><\/h1>\n<h1>Enhancing Binance’s Mainnet<\/h1>\n<p><strong>The primary objective of the project is to provide additional scalability, availability, and security to Binance&#8217;s main blockchain network.<\/strong> Currently, BNB Chain processes approximately 2,000 transactions per second at a fee of $0.10 per transaction. Meanwhile, opBNB&#8217;s stated performance is over 4,000 transactions per second with an average transaction cost below $0.005.<\/p>\n<p>Furthermore, opBNB will help optimize data availability and cache level, as well as enable concurrent transaction processing. <strong>The new L2 protocol has also implemented a fraud-checking scheme to further ensure system reliability.<\/strong><\/p>\n<p>Therefore, developers are provided with a Remote Procedure Call (RPC) service layer, simplifying the process of technological integration. At the same time, EVM interoperability allows opBNB to interact with <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/smart-contract\/\">smart contracts<\/a>, networks, and <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/erc-20\/\">ERC-20<\/a> token standards based on <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/ethereum\/\">Ethereum.<\/a> All of this enables developers to focus on application development without worrying about the complexities of Layer 2 scaling.<\/p>\n<h2><\/h2>\n<h2>Addressing the Scalability Challenge<\/h2>\n<p>&nbsp;<\/p>\n<p>BNB launches opBNB Testnet as a response to the<a href=\"https:\/\/info.dextools.io\/crypto-glossary\/scalability\/\"> scalability<\/a> challenge that has hindered widespread adoption of blockchain technology. As a layer 2 chain compatible with the Ethereum Virtual Machine (EVM), opBNB utilizes the Optimism OP Stack to enhance BSC scalability while maintaining affordability and security.<\/p>\n<p>&nbsp;<\/p>\n<h3>Here&#8217;s how opBNB improves scalability:<\/h3>\n<ul>\n<li><strong>Optimistic Rollups. <\/strong>They are  the underlying concept behind opBNB, which aims to reduce the computational load on the main chain by executing transactions off-chain and only posting transaction data on-chain as call data. This approach significantly improves scalability by bundling multiple transactions together before submitting them to the main chain.<\/li>\n<\/ul>\n<ul>\n<li><strong>Empowering Scalability. <\/strong>By combining the robust capabilities of BSC with opBNB&#8217;s dedicated features, such as streamlined data access, improved cache system, and optimized submission process algorithm (batcher), opBNB pushes the gas limit to an impressive 100M, surpassing Optimism&#8217;s 30M. This enhancement enables opBNB to handle over 4000 transfer transactions per second while keeping the average transaction cost below 0.005 USD.<\/li>\n<\/ul>\n<ul>\n<li><strong>Ensuring Transaction Validity with Fraud-Proving Scheme. <\/strong>BNB launches opBNB Testnet to implement a fraud-proving scheme to guarantee transaction validity. In this way, anyone can challenge the results of a rollup transaction by computing a fraud proof. Thus, successful challenges result in re-execution of the transaction(s), maintaining the integrity of the network.<\/li>\n<\/ul>\n<ul>\n<li><strong>Benefits for Projects and Developers: <\/strong>developers utilizing opBNB gain access to a robust and EVM-compatible platform that fosters the creation of open ecosystems. The opBNB team has contributed significantly to the Optimism Stack, supporting the expansion of Layer 2 solutions. <strong>Leveraging this stack simplifies the process for EVM developers to migrate or extend their applications to BSC, reaching a wider audience and accessing more resources as a result.<br \/>\n<\/strong><\/li>\n<\/ul>\n<p>Finally, projects can leverage opBNB&#8217;s improved throughput and significantly lower transaction costs, enhancing the user experience for their customers. Additionally, projects that previously struggled with high transaction volumes on BSC can thrive with opBNB&#8217;s increased scalability!<\/p>\n<h2>But&#8230; what is a testnet, exactly?<\/h2>\n<p>&nbsp;<\/p>\n<p>A <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/testnet\/\">testnet<\/a> is a dedicated blockchain network designed specifically for testing purposes. <strong>It functions as a virtual environment where developers and users can experiment with new features, evaluate smart contracts, and explore various functionalities without involving real or valuable assets.<\/strong><\/p>\n<p>Testnets replicate the essential capabilities of the mainnet, which is the live or production blockchain network. However, they operate under different rules and parameters.<strong> Typically, testnets have their own distinct tokens that hold no monetary value, enabling users to conduct transactions and interact with the network without any financial risks.<\/strong><\/p>\n<p>The primary purpose of testnets is to provide developers with a secure and controlled space to identify and address potential bugs or vulnerabilities in smart contracts and blockchain protocols before deploying them on the mainnet. Various cryptocurrencies have their own designated testnets, and developers and users can access these testnets through specialized software or tools provided by the cryptocurrency&#8217;s development team.<\/p>\n<h2>What is a mainnet?<\/h2>\n<p>&nbsp;<\/p>\n<p>A <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/mainnet\/\">mainnet<\/a> refers to the operational blockchain network of a specific cryptocurrency. <strong>It is the fully functional version of the blockchain that supports real transactions and involves the use of actual assets and funds.<\/strong><\/p>\n<p>The mainnet represents the official implementation of the cryptocurrency&#8217;s protocol and serves as the live environment, where users can engage in various activities such as <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/p2p-dex\/\">peer-to-peer<\/a> transfers, execution of smart contracts, and other network operations. It operates using real tokens or coins that possess financial value and can be traded, utilized, or held within the cryptocurrency ecosystem.<\/p>\n<p>Unlike testnets or development environments, the mainnet is the publicly accessible network that allows users, investors, and developers to interact with the cryptocurrency&#8217;s features and services. <strong>Transactions and operations conducted on the mainnet are considered valid and permanent as they are recorded on the official blockchain ledger.<\/strong><\/p>\n<p>The stability, security, and performance of a mainnet are of utmost importance for the success and credibility of a cryptocurrency. Developers continually strive to improve the mainnet&#8217;s functionalities, address any potential vulnerabilities, and ensure its seamless operation. Consequently, it serves as the foundation of the cryptocurrency ecosystem, enabling real-world transactions and fostering user engagement.<\/p>\n<h2><\/h2>\n<h2>And what is scalability in DeFi?<\/h2>\n<p>&nbsp;<\/p>\n<p>In broad terms,<a href=\"https:\/\/info.dextools.io\/crypto-glossary\/scalability\/\"> scalability<\/a> refers to the capacity of the underlying blockchain network or platform to handle a larger volume of transactions and users while maintaining optimal performance, security, and cost-effectiveness. In <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/defi\/\">DeFi<\/a> space, scalability is a pressing issue because popular blockchains like <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/ethereum\/\">Ethereum<\/a> have encountered limitations in processing transactions. As the user base and transaction load expand, network congestion, slower confirmation times, and elevated transaction fees become prevalent, hindering user experience and impeding widespread adoption.<\/p>\n<h2>Solutions to improve scalability<\/h2>\n<p>&nbsp;<\/p>\n<p>To address scalability concerns in crypto and DeFi, various solutions have been proposed and implemented:<\/p>\n<ul>\n<li><strong>Layer 2 Solutions:<\/strong> these protocols operate on top of existing blockchains and aim to enhance scalability by conducting some transactions off-chain. Layer 2 solutions, such as the Lightning Network for Bitcoin and Ethereum&#8217;s Optimistic Rollups and zkRollups, enable faster and more cost-effective transactions by executing them outside the main blockchain while preserving the security of the underlying network.<\/li>\n<li><strong>Sharding:<\/strong> this approach involves dividing the blockchain network into smaller interconnected segments called shards. Each shard can process its own transactions and smart contracts independently, significantly augmenting the network&#8217;s transaction throughput.<\/li>\n<li><strong>Sidechains:<\/strong> they are separate chains that interoperate with the main blockchain. They handle a subset of transactions and smart contracts, alleviating congestion on the primary blockchain and enabling faster, more scalable processing.<\/li>\n<li><strong>Blockchain Interoperability:<\/strong> interoperability establish connections between multiple blockchain networks, enabling the transfer of assets and data across different chains. By establishing bridges between blockchains, these solutions mitigate congestion on a single chain and distribute the workload across multiple networks.<\/li>\n<li><strong>Optimizations and Upgrades<\/strong>: Blockchain protocols continuously undergo refinements and upgrades to enhance scalability. This can involve improvements in consensus algorithms, network protocols, and transaction validation mechanisms.<\/li>\n<\/ul>\n<p>Scalability is a vital consideration for DeFi platforms, as it enables them to accommodate increasing numbers of users and transactions. By implementing scalable solutions, these platforms can support growing adoption, expedite transaction speeds, reduce <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/transaction-fee\/\">transaction fees,<\/a> and enhaence overall user experiences.<\/p>\n<h2><\/h2>\n<h2>Finally, let&#8217;s summarize the benefits of opBNB:<\/h2>\n<p>&nbsp;<\/p>\n<ol>\n<li><strong>Enhanced Scalability:<\/strong> opBNB supports over 4000 transfer transactions per second, which is ideal for applications with large daily active users. Developers can, therefore, ensure smooth and uninterrupted operations without worrying about network congestion. Lower transaction costs below USD 0.005 make it feasible to create applications requiring high-frequency micro-transactions, attracting more users and boosting adoption rates.<\/li>\n<li><strong>EVM Compatibility:<\/strong> opBNB&#8217;s EVM compatibility provides developers familiar with Ethereum&#8217;s tooling and dApps an accessible platform. This simplifies the migration or extension of existing Ethereum applications to BSC, broadening their reach in terms of audience and resources, consequently.<\/li>\n<li><strong>Security and Trust:<\/strong> opBNB maintains a strong focus on security with its fraud-proving scheme. All off-chain transactions are validated, ensuring an added layer of trust for developers and users. The transparency and verifiability of transactions on opBNB contribute to a safer application environment.<\/li>\n<li><strong>Future-Proof Development:<\/strong> with its robust and flexible framework, opBNB enables developers to adapt to changes, add new features, and experiment with innovative ideas. <strong>It is not just a solution for the present but also a strategic choice for future development.<\/strong> In short: BNB launches opBNB Testnet, which is an integral part of the thriving BSC ecosystem, allowing developers and projects to interact with various projects and tokens, including BNB, USDT and future ERC20 tokens supported on opBNB. This integration fosters the growth of diverse applications, from gaming <a href=\"https:\/\/info.dextools.io\/crypto-glossary\/dapp\/\"><strong>dApps<\/strong> <\/a> to social networks, within an efficient and cost-effective blockchain environment.<\/li>\n<\/ol>\n<p><em>In short: BNB launches opBNB Testnet, which is an integral part of the thriving BSC ecosystem. Allowing developers and projects to interact with various projects and tokens, including BNB, USDT and future ERC20 tokens supported on opBNB. This integration supports the growth of diverse applications, from gaming dApps to social networks, within an efficient and cost-effective blockchain environment.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; BNB launches opBNB Testnet. The BNB Chain team has announced the launch of opBNB, a Layer 2 network based on Optimism OP Stack and compatible with the Ethereum Virtual Machine (EVM). The new solution was released on June 19 as a test mode on the BNB Smart Chain (BSC) network. &nbsp; Start building using [&hellip;]<\/p>\n","protected":false},"author":3,"featured_media":2740,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[38],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.9 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>BNB launches opBNB Testnet - DEXTools Academy<\/title>\n<meta name=\"description\" content=\"BNB launches opBNB Testnet to improve Binance&#039;s main blockchain network. Learn more about scalability and testnets.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"BNB launches opBNB Testnet - DEXTools Academy\" \/>\n<meta property=\"og:description\" content=\"BNB launches opBNB Testnet to improve Binance&#039;s main blockchain network. Learn more about scalability and testnets.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/\" \/>\n<meta property=\"og:site_name\" content=\"DEXTools\" \/>\n<meta property=\"article:published_time\" content=\"2023-06-27T11:07:10+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-06-27T13:55:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/info.dextools.io\/content\/uploads\/2023\/06\/BNB-testnet_-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"1067\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"boni\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:image\" content=\"https:\/\/info.dextools.io\/content\/uploads\/2023\/06\/BNB-testnet_-1.jpg\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"boni\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"7 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/\"},\"author\":{\"name\":\"boni\",\"@id\":\"https:\/\/info.dextools.io\/#\/schema\/person\/dca900e516c7232784d7fc26f60685ff\"},\"headline\":\"BNB launches opBNB! Learn more about scalability and testnets.\",\"datePublished\":\"2023-06-27T11:07:10+00:00\",\"dateModified\":\"2023-06-27T13:55:04+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/\"},\"wordCount\":1521,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/info.dextools.io\/#organization\"},\"articleSection\":[\"News\"],\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/\",\"url\":\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/\",\"name\":\"BNB launches opBNB Testnet - DEXTools Academy\",\"isPartOf\":{\"@id\":\"https:\/\/info.dextools.io\/#website\"},\"datePublished\":\"2023-06-27T11:07:10+00:00\",\"dateModified\":\"2023-06-27T13:55:04+00:00\",\"description\":\"BNB launches opBNB Testnet to improve Binance's main blockchain network. Learn more about scalability and testnets.\",\"breadcrumb\":{\"@id\":\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/info.dextools.io\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"BNB launches opBNB! Learn more about scalability and testnets.\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/info.dextools.io\/#website\",\"url\":\"https:\/\/info.dextools.io\/\",\"name\":\"DEXTools\",\"description\":\"-\",\"publisher\":{\"@id\":\"https:\/\/info.dextools.io\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/info.dextools.io\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/info.dextools.io\/#organization\",\"name\":\"DEXTools\",\"url\":\"https:\/\/info.dextools.io\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/info.dextools.io\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/info.dextools.io\/content\/uploads\/2023\/05\/logo-transparente.png\",\"contentUrl\":\"https:\/\/info.dextools.io\/content\/uploads\/2023\/05\/logo-transparente.png\",\"width\":729,\"height\":847,\"caption\":\"DEXTools\"},\"image\":{\"@id\":\"https:\/\/info.dextools.io\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/info.dextools.io\/#\/schema\/person\/dca900e516c7232784d7fc26f60685ff\",\"name\":\"boni\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/info.dextools.io\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/30ca10279f2ee939dea7159362ca7399?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/30ca10279f2ee939dea7159362ca7399?s=96&d=mm&r=g\",\"caption\":\"boni\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"BNB launches opBNB Testnet - DEXTools Academy","description":"BNB launches opBNB Testnet to improve Binance's main blockchain network. Learn more about scalability and testnets.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/","og_locale":"en_US","og_type":"article","og_title":"BNB launches opBNB Testnet - DEXTools Academy","og_description":"BNB launches opBNB Testnet to improve Binance's main blockchain network. Learn more about scalability and testnets.","og_url":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/","og_site_name":"DEXTools","article_published_time":"2023-06-27T11:07:10+00:00","article_modified_time":"2023-06-27T13:55:04+00:00","og_image":[{"width":1600,"height":1067,"url":"https:\/\/info.dextools.io\/content\/uploads\/2023\/06\/BNB-testnet_-1.jpg","type":"image\/jpeg"}],"author":"boni","twitter_card":"summary_large_image","twitter_image":"https:\/\/info.dextools.io\/content\/uploads\/2023\/06\/BNB-testnet_-1.jpg","twitter_misc":{"Written by":"boni","Est. reading time":"7 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/#article","isPartOf":{"@id":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/"},"author":{"name":"boni","@id":"https:\/\/info.dextools.io\/#\/schema\/person\/dca900e516c7232784d7fc26f60685ff"},"headline":"BNB launches opBNB! Learn more about scalability and testnets.","datePublished":"2023-06-27T11:07:10+00:00","dateModified":"2023-06-27T13:55:04+00:00","mainEntityOfPage":{"@id":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/"},"wordCount":1521,"commentCount":0,"publisher":{"@id":"https:\/\/info.dextools.io\/#organization"},"articleSection":["News"],"inLanguage":"en-US","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/","url":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/","name":"BNB launches opBNB Testnet - DEXTools Academy","isPartOf":{"@id":"https:\/\/info.dextools.io\/#website"},"datePublished":"2023-06-27T11:07:10+00:00","dateModified":"2023-06-27T13:55:04+00:00","description":"BNB launches opBNB Testnet to improve Binance's main blockchain network. Learn more about scalability and testnets.","breadcrumb":{"@id":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/info.dextools.io\/bnb-launches-opbnb-testnet-scalability-binance-ethereum-evm-layer2\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/info.dextools.io\/"},{"@type":"ListItem","position":2,"name":"BNB launches opBNB! Learn more about scalability and testnets."}]},{"@type":"WebSite","@id":"https:\/\/info.dextools.io\/#website","url":"https:\/\/info.dextools.io\/","name":"DEXTools","description":"-","publisher":{"@id":"https:\/\/info.dextools.io\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/info.dextools.io\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/info.dextools.io\/#organization","name":"DEXTools","url":"https:\/\/info.dextools.io\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/info.dextools.io\/#\/schema\/logo\/image\/","url":"https:\/\/info.dextools.io\/content\/uploads\/2023\/05\/logo-transparente.png","contentUrl":"https:\/\/info.dextools.io\/content\/uploads\/2023\/05\/logo-transparente.png","width":729,"height":847,"caption":"DEXTools"},"image":{"@id":"https:\/\/info.dextools.io\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/info.dextools.io\/#\/schema\/person\/dca900e516c7232784d7fc26f60685ff","name":"boni","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/info.dextools.io\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/30ca10279f2ee939dea7159362ca7399?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/30ca10279f2ee939dea7159362ca7399?s=96&d=mm&r=g","caption":"boni"}}]}},"_links":{"self":[{"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/posts\/2697"}],"collection":[{"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/comments?post=2697"}],"version-history":[{"count":33,"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/posts\/2697\/revisions"}],"predecessor-version":[{"id":2737,"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/posts\/2697\/revisions\/2737"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/media\/2740"}],"wp:attachment":[{"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/media?parent=2697"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/categories?post=2697"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/info.dextools.io\/wp-json\/wp\/v2\/tags?post=2697"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}